Update useCaseDiagram.md
